# Module 1.2 - Explore Data

In this lesson, you will learn how to do exploratory data analysis (EDA). In the EDA phase, you need to understand what information is in your dataset in order to later clean and prepare the data for predictive analysis.

## Python libraries

Libraries have pre-defined code for other functions that are not included in basic Python. Once a library has been imported, any of its functions can be used throughout the entire notebook. Some libraries have long names that may be easy to misspell when using its functions, so it is common practice to assign a library to an alias name using `as`.

In [3]:
import numpy as np  # numpy used for linear algebra functions
import pandas as pd # pandas used to explore and manipulate dataframes

## Load data

This notebook is a file in which we will explore the data but before that can be done, we must first read in a copy of it from the file that it's stored in. The `pandas` library will read the information in a file and then format it into a row-column structure called a ***dataframe***. Dataframes are similar to a table or spreadsheet and can be used within Python to explore and manipulate items in the rows or columns.

### CSV files

CSV stands for "comma separated values". It is a plain text file where each value in a line is separated by some delimiter (usually commas but can be tabs, semicolons, spaces, etc.). In `pandas` the function to read data from a CSV file is `.read_csv(name of file)`. The path to the file with data should be typed inside the parentheses (as a string) of the `.read_csv()` function. If the data file and the notebook file are located in the same folder, then just the name of the file is required. The `.read_csv()` function assumes that the first line of information in the file will be the column header names for the dataset.

In [4]:
#load a csv file named "smallgradesh.csv" located in the datasets folder

location = "datasets/smallgradesh.csv"
df = pd.read_csv(location)

### Dataframes

Unlike spreadsheets in tools such as Microsoft Excel, dataframes are not meant to be viewed in full detail (meaning, scroll through every single row of information). Instead, to verify that the data was loaded in properly, the `.head()` and `.tail()` functions show several rows and columns within the dataset. By default, the `.head()` and `.tail()` functions show the first/last five rows of the dataset. The number of rows shown can be altered by setting the number inside the function parentheses. However, if the number of rows requested is excessive, then the dataframe will only show several rows from the top of the dataframe, skip the middle section, and then show the last few rows. Additional features of the data can be verified using other exploratory functions to determine if any data formatting needs to be done.

In [8]:
# this will show first 5 rows in the dataframe
df.head()

      Name  Grade
0   Marcia   82.4
1   Kadeem   78.2
2     Nash   79.3
3  Noelani   83.2
4  Noelani   87.4

In [5]:
df.tail()

           Name  Grade
1995       Cody   80.1
1996  Geraldine  100.0
1997   Mercedes   84.9
1998     Lucius   69.1
1999      Linus   79.6

*NOTE*: In Jupyter notebook, whenever you do not remember what a function does or need to know what parameters/arguments can be used in it, just type the function name witha question mark at the end (no parentheses) and run the cell.

In [ ]:
#df.head?

In [ ]:
# this will show the last 3 rows of the dataframe
df.tail(3)

### Data without headers

If the file (CSV, Excel, etc.) does not contain column header names, then the argument `header=None` is used to read the first line in the file as the first row in the dataframe. In addition, you can add column header names while reading in the data using the `names=[list of column names]` argument in the function. Column headers can also be added after the data has been loaded as a dataframe - first, type the dataframe variable name and use the `.columns` function (this will access the names of the columns). Then on the right side of an equal sign (assignment operator) type a Python list of all of the new header names in the position order of the columns (this also works for renaming columns).

In [6]:
location2 = "datasets/smallgrades.csv"

# CSV file that does not have column header names
# Python creates index position placeholder names for the columns

df_nohead = pd.read_csv(location2) #try w/o header=None

df_nohead.head()

    Marcia  82.4
0   Kadeem  78.2
1     Nash  79.3
2  Noelani  83.2
3  Noelani  87.4
4     Neil  88.7

In [25]:
print(df_nohead)

              0      1
0        Marcia   82.4
1        Kadeem   78.2
2          Nash   79.3
3       Noelani   83.2
4       Noelani   87.4
5          Neil   88.7
6         Nelle   80.2
7       Armando   95.1
8       Illiana   76.5
9          Neil   89.7
10       Daquan   85.2
11         Nola   75.3
12        Quinn   80.7
13      Frances   84.2
14      Lareina   87.6
15        Medge   75.8
16         Kibo   88.2
17        Libby  100.0
18       Shelly   84.3
19         Lane   84.2
20      Isadora   79.1
21        Maggy   90.5
22        Elton   71.0
23        Lance   90.3
24         Kyle   82.4
25        Colin   83.8
26      Solomon   94.5
27         Ulla   83.5
28        Tyler   69.7
29         Emma   91.1
...         ...    ...
1970    Armando   93.2
1971      Haley   90.4
1972      Fritz   79.5
1973  Allistair   74.2
1974       Ella   68.0
1975      Felix   75.2
1976       Dean   74.5
1977    Quinlan   85.6
1978      Kiara   82.7
1979        Kai  100.0
1980     Maxine   91.9
1981       Leah  100.0
1982      Kalia   61.4
1983    Anthony   93.1
1984     Joshua   72.7
1985      Akeem   74.4
1986     Indigo   91.3
1987      Price   78.6
1988      Quinn   78.0
1989       John   91.2
1990      Adena   70.2
1991      Craig   64.9
1992   Isabelle   78.5
1993       Risa   74.3
1994    Emerson   67.5
1995       Cody   80.1
1996  Geraldine  100.0
1997   Mercedes   84.9
1998     Lucius   69.1
1999      Linus   79.6

[2000 rows x 2 columns]

In [26]:
# from the same file in the previous cell
# this time we will add on column header names as the data is loaded

df_during = pd.read_csv(location2, names=['Name', 'Grade'])

df_during.head()

      Name  Grade
0   Marcia   82.4
1   Kadeem   78.2
2     Nash   79.3
3  Noelani   83.2
4  Noelani   87.4

In [27]:
#verify that this dataframe has no column header names
df_nohead.head()

         0     1
0   Marcia  82.4
1   Kadeem  78.2
2     Nash  79.3
3  Noelani  83.2
4  Noelani  87.4

In [ ]:
# add header names to "df_nohead" dataframe

df_nohead.columns = ['Name', 'Grade']
df_nohead.head()

### Excel files

In `pandas` the function to read in data from an Excel file is `.read_excel()` and works similarly to the `.read_csv()` function.

In [28]:
#import data from Excel file

location = "datasets/gradedata.xlsx"
df = pd.read_excel(location) #overwrites the info from the df variable in the examples above
df.head()

,fname,lname,gender,age,exercise,hours,grade,address
0,Marcia,Pugh,female,17,3,10,82.4,"7379 Highland Rd. , Dublin, GA 31021"
1,Kadeem,Morrison,male,18,4,4,78.2,"8 Bayport St. , Honolulu, HI 96815"
2,Nash,Powell,male,18,5,9,79.3,"Encino, CA 91316, 3 Lilac Street"
3,Noelani,Wagner,female,14,2,7,83.2,"Riverview, FL 33569, 9998 North Smith Dr."
4,Noelani,Cherry,female,18,4,15,87.4,"97 SE. Ocean Street , Bethlehem, PA 18015"

## Make a file from dataframe

Usually after the data has been manipulated and transformed into a format that the user is satisfied with, it may be the case that the information is going to be used within another program (Excel, Tableau, etc.). Because the data cannot be directly sent from Jupyter notebook to another application, we can create a file from the dataframe. CSV is the easiest format to use for the data but other file formats can be used as well (Excel, JSON). 

#### Zip function
- Is a Python built-in function that allows us to combine corresponding elements from multiple sequences into a single list of tuples.

In [46]:
# create fake data

names = ['Bob','Jessica','Mary','John','Mel','kkk']
grades = [76,95,77,78,99,28]
ids =[11,12,13,14,15,35]
GradeList = list(zip(names,grades,ids))

df = pd.DataFrame(data = GradeList, columns=['Names','Grades', 'IDs'])

In [47]:
df.head()
print(df)

     Names  Grades  IDs
0      Bob      76   11
1  Jessica      95   12
2     Mary      77   13
3     John      78   14
4      Mel      99   15
5      kkk      28   35

### Export data to CSV file

In [38]:
# export data to a file called "studentgrades.csv"
# file will be created in the same folder as the notebook, unless specified

df.to_csv('studentgrades.csv',index=False,header=False)

In [39]:
print(df)

     Names  Grades  IDs
0      Bob      76   11
1  Jessica      95   12
2     Mary      77   13
3     John      78   14
4      Mel      99   15

In [41]:
df.to_excel('studentgrades.xlsx', index=False, header=False)
print(df)

     Names  Grades  IDs
0      Bob      76   11
1  Jessica      95   12
2     Mary      77   13
3     John      78   14
4      Mel      99   15

### Export data to Excel file

In [48]:
# create Excel file from dataframe
# "engine" parameter tells file what Excel format encoding (.xls, .xlsx) to create

writer = pd.ExcelWriter('dataframe.xlsx', engine='xlsxwriter')
df.to_excel(writer, sheet_name='Sheet1')
writer.save()

In [50]:
# export different dataframes to separate sheets in same Excel file

writer = pd.ExcelWriter('dataframe.xlsx', engine='xlsxwriter')

df.to_excel(writer, sheet_name='Sheet1')
df_nohead.to_excel(writer, sheet_name='Sheet2')

writer.save()

## Data Features

The first steps in the EDA process should be to verify that the data is properly loaded (using `.head()` or `.tail()`), checking the number of rows and columns, finding out what columns exist in the dataset, and also the data type of each column.

### Exploratory Analysis
It is use for gaining a better understanding of data aspects like:
- main features of data
- variables and relationships that hold between them
- identifying which variables are important for our problem

In [51]:
#load gradedata.csv file

location= "datasets/gradedata.csv"
df = pd.read_csv(location)

df.head()

,fname,lname,gender,age,exercise,hours,grade,address
0,Marcia,Pugh,female,17,3,10,82.4,"9253 Richardson Road, Matawan, NJ 07747"
1,Kadeem,Morrison,male,18,4,4,78.2,"33 Spring Dr., Taunton, MA 02780"
2,Nash,Powell,male,18,5,9,79.3,"41 Hill Avenue, Mentor, OH 44060"
3,Noelani,Wagner,female,14,2,7,83.2,"8839 Marshall St., Miami, FL 33125"
4,Noelani,Cherry,female,18,4,15,87.4,"8304 Charles Rd., Lewis Center, OH 43035"

In [91]:
print(df)

          fname      lname  gender  age  exercise  hours  grade  \
0        Marcia       Pugh  female   17         3     10   82.4
1        Kadeem   Morrison    male   18         4      4   78.2
2          Nash     Powell    male   18         5      9   79.3
3       Noelani     Wagner  female   14         2      7   83.2
4       Noelani     Cherry  female   18         4     15   87.4
5          Neil    Whitley    male   16         5     16   88.7
6         Nelle     Golden  female   17         1      9   80.2
7       Armando    Hoffman    male   17         5     18   95.1
8       Illiana      Rojas  female   15         5      9   76.5
9          Neil     Wooten    male   15         3     15   89.7
10       Daquan    Alvarez    male   16         2     13   85.2
11         Nola  Velazquez  female   15         2     10   75.3
12        Quinn     Warren  female   14         4     12   80.7
13      Frances  Velasquez  female   15         2     15   84.2
14      Lareina      Poole  female   18         1     14   87.6
15        Medge   Mccarthy  female   15         1      8   75.8
16         Kibo      Gates    male   16         1     10   88.2
17        Libby     Guzman  female   19         1     19  100.0
18       Shelly    Rosario  female   18         4     13   84.3
19         Lane       Tate    male   19         4     11   84.2
20      Isadora       Case  female   18         3     11   79.1
21        Maggy  Whitfield  female   15         1     15   90.5
22        Elton     Wagner    male   16         2      9   71.0
23        Lance   Benjamin    male   14         5     18   90.3
24         Kyle    Skinner    male   17         5      6   82.4
25        Colin      Cohen    male   14         1     10   83.8
26      Solomon  Mcpherson    male   15         5     18   94.5
27         Ulla     Warren  female   18         1     16   83.5
28        Tyler    Collier    male   16         1      9   69.7
29         Emma     Mccall  female   16         2     13   91.1
...         ...        ...     ...  ...       ...    ...    ...
1970    Armando    Mcclure    male   19         2     14   93.2
1971      Haley    Mcgowan  female   17         3     16   90.4
1972      Fritz      Rojas    male   17         5     13   79.5
1973  Allistair      Boyer    male   14         3     10   74.2
1974       Ella  Patterson  female   16         1      8   68.0
1975      Felix    Freeman    male   15         4     11   75.2
1976       Dean      Oneil    male   16         2      8   74.5
1977    Quinlan    Hawkins    male   14         3     18   85.6
1978      Kiara       Lott  female   17         2     12   82.7
1979        Kai    Woodard  female   17         5     17  100.0
1980     Maxine    Raymond  female   17         4     19   91.9
1981       Leah   Lawrence  female   15         5     15  100.0
1982      Kalia      Lewis  female   18         1      6   61.4
1983    Anthony     Palmer    male   14         1     14   93.1
1984     Joshua   Randolph    male   15         1      4   72.7
1985      Akeem       Luna    male   15         4      6   74.4
1986     Indigo      Mccoy  female   19         2     14   91.3
1987      Price       Wall    male   15         5     11   78.6
1988      Quinn  Patterson    male   15         1     14   78.0
1989       John       Ford    male   14         2     14   91.2
1990      Adena     Battle  female   17         2      8   70.2
1991      Craig     Obrien    male   16         3      7   64.9
1992   Isabelle     Barber  female   14         5      9   78.5
1993       Risa     Watson  female   14         2     10   74.3
1994    Emerson       Gill    male   17         5      5   67.5
1995       Cody   Shepherd    male   19         1      8   80.1
1996  Geraldine   Peterson  female   16         4     18  100.0
1997   Mercedes       Leon  female   18         3     14   84.9
1998     Lucius    Rowland    male   16         1      7   69.1
1999      Linus     Morris    male   19         4     10   79.6

                                               address
0              9253 Richardson Road, Matawan, NJ 07747
1                     33 Spring Dr., Taunton, MA 02780
2                     41 Hill Avenue, Mentor, OH 44060
3                   8839 Marshall St., Miami, FL 33125
4             8304 Charles Rd., Lewis Center, OH 43035
5             40 Washington Ave., Bloomfield, NJ 07003
6                9768 Hanover Dr., Meadville, PA 16335
7                360 Manor Drive, Northville, MI 48167
8             9425 Studebaker Dr., Thibodaux, LA 70301
9              400 Bridge Court, Soddy Daisy, TN 37379
10             9028 Arnold Circle, Elizabeth, NJ 07202
11                 72 Bradford Dr., Carlisle, PA 17013
12                760 Smith Street, Appleton, WI 54911
13                     57 Bridge St., Tupelo, MS 38801
14                      59 Court Dr., Waxhaw, NC 28173
15              609 Warren Court, Prior Lake, MN 55372
16                  24 Vernon Street, Helena, MT 59601
17              666 S. Pennington Rd., Dover, NH 03820
18          571 Miles Street, Flowery Branch, GA 30542
19           4 Old Westport St., Glen Burnie, MD 21060
20                   44 Ocean Lane, Appleton, WI 54911
21                    2 Henry Ave., Palm Bay, FL 32907
22              98 Indian Spring St., Athens, GA 30605
23                      55 Creek Dr., Lorton, VA 22079
24         8593 East Branch St., Mooresville, NC 28115
25            23 Lakewood Street, Lake Worth, FL 33460
26     7465 North Pearl St., Massapequa Park, NY 11762
27               89 Fairview Avenue, Hopkins, MN 55343
28             65 Lookout Street, Marshfield, WI 54449
29               854 Sussex Street, Westford, MA 01886
...                                                ...
1970                23 Hall Road, Hagerstown, MD 21740
1971        4 Wellington Street, Saint Louis, MO 63109
1972         16 East Edgewood St., Ashtabula, OH 44004
1973                9373 Helen Drive, Leland, NC 28451
1974              999 Nicolls Avenue, Oviedo, FL 32765
1975             671 Division Ave., Vineland, NJ 08360
1976        653 East Saxton Lane, Framingham, MA 01701
1977       9437 Longbranch Street, Rockville, MD 20850
1978           7110 Ridge Road, Jacksonville, NC 28540
1979              37 Addison St., Eastpointe, MI 48021
1980               739 Thomas Court, Memphis, TN 38106
1981           652 Pine Drive, Mountain View, CA 94043
1982    557 Theatre Lane, Green Cove Springs, FL 32043
1983  914 NW. Lawrence Street, Lawrenceville, GA 30043
1984       9632 NE. Lakeshore St., Riverside, NJ 08075
1985              750 Adams Drive, Goldsboro, NC 27530
1986         9652 Columbia Ave., Chattanooga, TN 37421
1987           8672 S. 53rd Drive, Waterford, MI 48329
1988           634 Cedar Swamp Ave., Burbank, IL 60459
1989       64 Devonshire Street, Orange Park, FL 32065
1990       9272 Elizabeth Drive, Londonderry, NH 03053
1991                524 Park Ave., Hollywood, FL 33020
1992         955 Glen Ridge Rd., Plattsburgh, NY 12901
1993     37 Augusta Lane, Montgomery Village, MD 20886
1994       75 Wild Horse Street, Panama City, FL 32404
1995             982 West Street, Alexandria, VA 22304
1996        78 Morris Street, East Northport, NY 11731
1997             30 Glenridge Rd., Bountiful, UT 84010
1998       342 West Meadowbrook Lane, Helena, MT 59601
1999            81 Homestead Drive, Voorhees, NJ 08043

[2000 rows x 8 columns]

In [52]:
data= "datasets/gradedata.csv"
df = pd.read_csv(data)

df.head()

,fname,lname,gender,age,exercise,hours,grade,address
0,Marcia,Pugh,female,17,3,10,82.4,"9253 Richardson Road, Matawan, NJ 07747"
1,Kadeem,Morrison,male,18,4,4,78.2,"33 Spring Dr., Taunton, MA 02780"
2,Nash,Powell,male,18,5,9,79.3,"41 Hill Avenue, Mentor, OH 44060"
3,Noelani,Wagner,female,14,2,7,83.2,"8839 Marshall St., Miami, FL 33125"
4,Noelani,Cherry,female,18,4,15,87.4,"8304 Charles Rd., Lewis Center, OH 43035"

In [53]:
# total number of rows in dataframe
len(df)

2000

In [54]:
# show the number of rows and columns in a dataframe
# format is (# rows, # columns)
df.shape

(2000, 8)

In [62]:
#show the column names in the dataset
#or print(df.columns)
df.columns

Index(['fname', 'lname', 'gender', 'age', 'exercise', 'hours', 'grade',
       'address'],
      dtype='object')

In [60]:
#show the data type of each column
df.dtypes

fname        object
lname        object
gender       object
age           int64
exercise      int64
hours         int64
grade       float64
address      object
dtype: object

In [57]:
#number of non-null (missing) values in each column
df.count()

fname       2000
lname       2000
gender      2000
age         2000
exercise    2000
hours       2000
grade       2000
address     2000
dtype: int64

In [70]:
len(df.columns)

8

In [79]:
df.groupby('gender').mean()

           age  exercise   hours    grade
gender
female  16.568     3.047  10.932  82.7173
male    16.589     2.954  11.045  82.3948

## Descriptive Statistics

Descriptive statistics, also called summary statistics, are a way to get information about the characteristics of a column. Common features include the maximum and minimum values, the total (sum) of all the values, and the mean or median (measures of central tendency).

To access a column in the dataframe use the dataframe variable name followed by a pair of square brackets with the name of the column (as a string) inside of it (similar to getting the value from a dictionary using a key).

In [71]:
# df_name['column name'] to access a column

# maximum age (oldest student)
df['age'].max()

19

In [87]:
# minimum age (youngest student)
df['age'].min()

14

In [72]:
# total sum of ages
df['age'].sum()

33157

### Mean
Refers to the mean or average that is used to derive the central tendency of the data in question. It is determined by adding all the data points in a population and then dividing the total by the number of points. The resulting number is known as the mean or the average.

In [73]:
# mean age (arithmetic average)
df['age'].mean()

16.5785

In [88]:
df.groupby('gender').agg({"age":'mean', "hours":'mean'})

           age   hours
gender
female  16.568  10.932
male    16.589  11.045

### Median
 - The "middle" of a sorted list of numbers. 
 - If the number of terms is odd, then the median is the value of the term in the middle.
 - If the number of terms is even, then the median is the average of the two terms in the middle

In [82]:
# middle average age (median)
df['age'].median()

17.0

### Mode
- Is the value of the term that occurs the most often.
- Sometimes there is more than one mode. This happens when two or more terms occur with equal frequency, and more often than any of the others

In [83]:
# mode age (most frequently occuring) of all students
# can have two or more most frequent values
df['age'].mode()

0    17
dtype: int64

### Standard deviation
- Is a measure of the amount of variation or dispersion of a set of values.[1] A low standard deviation indicates that the values tend to be close to the mean (also called the expected value) of the set, while a high standard deviation indicates that the values are spread out over a wider range.
- In statistics, the 689599.7 rule, also known as the empirical rule, is a shorthand used to remember the percentage of values that lie within a band around the mean in a normal distribution 

Calculate Standard Deviation

<img src=" https://www.thoughtco.com/thmb/GVy7U2pn2FP2Tut4MG53ZiCgOCQ=/768x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/calculate-a-sample-standard-deviation-3126345-v4-CS-01-5b76f58f46e0fb0050bb4ab2.png">


- The mean value is calculated by adding all the data points and dividing by the number of data points.
- The variance for each data point is calculated, first by subtracting the value of the data point from the mean. Each of those resulting values is then squared and the results summed. The result is then divided by the number of data points less one.
- The square root of the varianceresult from no. 2is then taken to find the standard deviation.

In [75]:
# standard deviation (distance away from mean)
df['age'].std()

1.6962536332147102

#### Describe function
df.describe()

- NaN values has been ignored while calculating these statistical values.
- It excludes character column and calculate summary statistics only for numeric columns
- Function gives the mean, std and IQR values. 
- The interquartile range (IQR) is the difference between the 75th and 25th percentile of the data. It is a measure of the dispersion similar to standard deviation or variance, but is much more robust against outliers.

In [84]:
#descriptive statistics
df.describe()

               age     exercise        hours        grade
count  2000.000000  2000.000000  2000.000000  2000.000000
mean     16.578500     3.000500    10.988500    82.556050
std       1.696254     1.423205     4.063942     9.747593
min      14.000000     0.000000     0.000000    32.000000
25%      15.000000     2.000000     8.000000    75.575000
50%      17.000000     3.000000    11.000000    82.700000
75%      18.000000     4.000000    14.000000    89.700000
max      19.000000     5.000000    20.000000   100.000000

In [90]:
#unique ages (distinct values)
df['address'].unique()

array(['9253 Richardson Road, Matawan, NJ 07747',
       '33 Spring Dr., Taunton, MA 02780',
       '41 Hill Avenue, Mentor, OH 44060', ...,
       '30 Glenridge Rd., Bountiful, UT 84010',
       '342 West Meadowbrook Lane, Helena, MT 59601',
       '81 Homestead Drive, Voorhees, NJ 08043'], dtype=object)

In [89]:
df['lname'].unique()

array(['Pugh', 'Morrison', 'Powell', 'Wagner', 'Cherry', 'Whitley',
       'Golden', 'Hoffman', 'Rojas', 'Wooten', 'Alvarez', 'Velazquez',
       'Warren', 'Velasquez', 'Poole', 'Mccarthy', 'Gates', 'Guzman',
       'Rosario', 'Tate', 'Case', 'Whitfield', 'Benjamin', 'Skinner',
       'Cohen', 'Mcpherson', 'Collier', 'Mccall', 'Newman', 'Acosta',
       'Munoz', 'Melendez', 'Larsen', 'Sexton', 'Arnold', 'Jacobs',
       'Brock', 'Sears', 'Cunningham', 'Copeland', 'Guerrero', 'Hamilton',
       'Ford', 'Melton', 'Castaneda', 'Bullock', 'Clayton', 'Klein',
       'Chambers', 'Goff', 'Walker', 'Livingston', 'Fuller', 'Kline',
       'Dunlap', 'Sosa', 'Harvey', 'Vaughn', 'Mooney', 'Lowery', 'Adkins',
       'Roman', 'Thompson', 'Pope', 'Foley', 'Morris', 'Patrick',
       'Benson', 'Berger', 'Briggs', 'Bowers', 'Oconnor', 'Maldonado',
       'Lopez', 'Justice', 'Guthrie', 'Pacheco', 'Lyons', 'Holden',
       'Rich', 'Villarreal', 'Hopkins', 'Ware', 'Gutierrez', 'Molina',
       'Herrera', 'Campbell', 'Rosales', 'Craig', 'Lara', 'Mcconnell',
       'Mckinney', 'Cooke', 'Hughes', 'Johnston', 'Howell', 'Morton',
       'Cleveland', 'Key', 'Mitchell', 'Park', 'Donaldson', 'Haley',
       'Gordon', 'Howard', 'Rollins', 'Barlow', 'Terrell', 'Ratliff',
       'Osborne', 'Watkins', 'Wilkerson', 'Wilson', 'Hayden', 'Vaughan',
       'Romero', 'Rice', 'Sullivan', 'Gray', 'Jennings', 'Jones',
       'Mcfadden', 'Payne', 'Smith', 'Shannon', 'Mcdowell', 'Schultz',
       'Harrington', 'Wall', 'Bowman', 'Castro', 'Duran', 'Lawrence',
       'Bird', 'Koch', 'Flynn', 'Salas', 'Hardy', 'Sharp', 'Weber',
       'Walters', 'Mays', 'Wells', 'Hart', 'Callahan', 'Gilbert', 'Le',
       'Holt', 'Welch', 'Strickland', 'Miranda', 'Ramos', 'Palmer',
       'Weaver', 'Preston', 'Johns', 'Farrell', 'Kaufman', 'Washington',
       'Meadows', 'Mclean', 'Tucker', 'Stuart', 'Bonner', 'Deleon', 'Cox',
       'Padilla', 'Daugherty', 'Beach', 'George', 'David', 'Hess',
       'Mcdonald', 'Salazar', 'Drake', 'Eaton', 'Carey', 'Wade',
       'Aguilar', 'Snyder', 'Burris', 'Webster', 'Calderon', 'Rose',
       'Goodman', 'Stevens', 'Gonzales', 'Ayala', 'Malone', 'Workman',
       'Zimmerman', 'Stark', 'Knowles', 'Raymond', 'Bishop', 'Ray',
       'Cote', 'Silva', 'Schmidt', 'Coffey', 'Hansen', 'Kirkland',
       'Navarro', 'Delacruz', 'Cummings', 'Mcgowan', 'Hays', 'Castillo',
       'Snider', 'Delaney', 'Nicholson', 'Mullins', 'Moon', 'Morse',
       'Wolf', 'Jenkins', 'Hester', 'Logan', 'Herring', 'Russell',
       'Donovan', 'Rivers', 'Ryan', 'Gallagher', 'Middleton', 'Hammond',
       'Day', 'Ward', 'Peck', 'Moreno', 'Oneal', 'Russo', 'Kennedy',
       'Downs', 'Shaw', 'Dominguez', 'Hewitt', 'Lynn', 'Ramsey',
       'Merritt', 'Mayer', 'Hinton', 'Phillips', 'Nunez', 'Combs',
       'Marshall', 'Garcia', 'Dickson', 'Estrada', 'Espinoza', 'Cruz',
       'Dotson', 'Chang', 'Rowland', 'Vincent', 'Bowen', 'Branch',
       'Allison', 'Warner', 'Higgins', 'Vargas', 'Mendez', 'Boyle',
       'Walton', 'Barton', 'Ellis', 'Schroeder', 'King', 'Fletcher',
       'Dorsey', 'Hogan', 'Reed', 'Rios', 'Kirk', 'Garrison', 'Webb',
       'Tran', 'Williamson', 'Morales', 'Randall', 'Wilkins', 'Cain',
       'Petersen', 'Carson', 'Perez', 'Everett', 'Rodriquez', 'Wolfe',
       'Harper', 'Hall', 'West', 'Collins', 'Christian', 'Nielsen',
       'Santiago', 'Harrell', 'Horton', 'Hensley', 'Ballard', 'Valdez',
       'Sparks', 'Ball', 'Santana', 'Gonzalez', 'Douglas', 'Hoover',
       'Horne', 'Wheeler', 'Solomon', 'Rodgers', 'Dawson', 'Sharpe',
       'Trevino', 'Blanchard', 'Diaz', 'Finch', 'Winters', 'Knapp',
       'Kinney', 'Hurley', 'Bell', 'Avery', 'Jacobson', 'Ochoa',
       'Dickerson', 'Boyer', 'Mcmillan', 'Jordan', 'Dodson', 'Lawson',
       'Church', 'Becker', 'Mcmahon', 'Vega', 'Crane', 'Alexander',
       'Baldwin', 'Huber', 'Frye', 'Potts', 'Reeves', 'Rodriguez',
       'Ferrell', 'Christensen', 'Beck', 'Hanson', 'Austin', 'Snow',
       'Wilkinson', 'Moses', 'Sloan', 'Grant', 'Prince', 'Carver',
       'Sweeney', 'Bradshaw', 'Bender', 'Finley', 'Stout', 'Spears',
       'Murphy', 'Parrish', 'Fernandez', 'Stephenson', 'Love', 'Shepherd',
       'Juarez', 'Bond', 'Kelley', 'Coleman', 'Bryan', 'Freeman',
       'Manning', 'Vang', 'Mcguire', 'Estes', 'Hodge', 'Henderson',
       'Gibbs', 'Parsons', 'Brady', 'Stewart', 'Sanchez', 'Waller',
       'Woodward', 'Sherman', 'Carpenter', 'Crawford', 'Mcgee', 'Watts',
       'Mcbride', 'Clarke', 'Alford', 'Kent', 'Lang', 'Fields', 'Kelly',
       'Suarez', 'Oliver', 'Townsend', 'Lane', 'Paul', 'Keller',
       'Gilmore', 'Salinas', 'Leon', 'Vasquez', 'Mccormick', 'Burton',
       'Vance', 'Bass', 'Greene', 'Carlson', 'Buckner', 'Sheppard',
       'Patel', 'Mills', 'Conrad', 'Maynard', 'Taylor', 'Walter', 'Hines',
       'Cotton', 'Humphrey', 'Nieves', 'Reese', 'Madden', 'Porter',
       'Hull', 'Hudson', 'Cantrell', 'Giles', 'Huff', 'Odom', 'Daniels',
       'Tyson', 'Burt', 'Bradley', 'Reilly', 'Holder', 'Pierce',
       'Underwood', 'Duke', 'Green', 'Marsh', 'Ashley', 'Murray', 'Rush',
       'Berry', 'Tanner', 'Fowler', 'Gillespie', 'Riggs', 'Cortez',
       'Crosby', 'Odonnell', 'Singleton', 'Cobb', 'Franks', 'Whitaker',
       'Vazquez', 'Puckett', 'Zamora', 'Lynch', 'Holman', 'Knox',
       'Benton', 'Buchanan', 'Willis', 'House', 'Cooley', 'Maddox',
       'Wise', 'Barr', 'Bruce', 'Charles', 'Hendricks', 'Heath', 'Steele',
       'Fisher', 'Rowe', 'Gay', 'Burgess', 'Mullen', 'Stafford',
       'Elliott', 'Nichols', 'Moss', 'James', 'Landry', 'Sims', 'Hyde',
       'Valenzuela', 'Campos', 'Frazier', 'Haynes', 'Moran', 'Bailey',
       'Hayes', 'Ingram', 'Gould', 'Burke', 'Miles', 'Dillon', 'Marquez',
       'Parks', 'Myers', 'Pearson', 'Roberson', 'Walsh', 'Sellers',
       'Calhoun', 'Curry', 'Aguirre', 'Ruiz', 'Turner', 'Decker',
       'Rasmussen', 'Davenport', 'Holcomb', 'Ramirez', 'Joyce', 'Wiley',
       'Bennett', 'Merrill', 'Mueller', 'Graves', 'Harding', 'Stone',
       'Marks', 'Goodwin', 'Fitzgerald', 'Acevedo', 'Maxwell',
       'Blackburn', 'Lambert', 'Lewis', 'Sandoval', 'Page', 'Harmon',
       'Mclaughlin', 'Thomas', 'York', 'Riley', 'Britt', 'Franklin',
       'Greer', 'Sanders', 'Cervantes', 'Kim', 'Talley', 'Craft',
       'Little', 'Potter', 'Reyes', 'Conley', 'Mercado', 'Edwards',
       'White', 'Cameron', 'Atkins', 'Trujillo', 'Mckay', 'Serrano',
       'Pratt', 'Gaines', 'Stephens', 'Barron', 'Davidson', 'Noble',
       'Francis', 'Buck', 'Ross', 'Hahn', 'Griffin', 'Wilder', 'Garrett',
       'Slater', 'Gibson', 'Olson', 'Simmons', 'Casey', 'Davis', 'Pruitt',
       'Bean', 'Armstrong', 'Cross', 'Valentine', 'Cannon', 'Ellison',
       'Mack', 'Graham', 'Barber', 'Massey', 'Gilliam', 'Hopper', 'Woods',
       'Scott', 'Chase', 'Blake', 'Cardenas', 'Evans', 'Cole', 'Hawkins',
       'Lloyd', 'Michael', 'Osborn', 'Hebert', 'Perry', 'Keith', 'Cantu',
       'Frank', 'Small', 'Roth', 'Phelps', 'Parker', 'Clay', 'Pate',
       'Flores', 'Shields', 'Barry', 'Boyd', 'Moore', 'Mathis',
       'Hatfield', 'Byers', 'Vinson', 'Kirby', 'Dillard', 'Bradford',
       'Oneill', 'Contreras', 'Robles', 'Simon', 'Caldwell', 'Brennan',
       'Emerson', 'Fitzpatrick', 'Martinez', 'Frost', 'Pickett',
       'Lindsey', 'Rhodes', 'Horn', 'Avila', 'Luna', 'Barker', 'Noel',
       'Morrow', 'Bryant', 'Chapman', 'Erickson', 'Spence', 'Martin',
       'Baker', 'Guerra', 'Short', 'Reynolds', 'Battle', 'Waters',
       'Dejesus', 'Newton', 'Doyle', 'Guy', 'Faulkner', 'Mendoza',
       'Farmer', 'Galloway', 'Joyner', 'Medina', 'Wiggins', 'Yates',
       'Gill', 'Kane', 'Conner', 'Mcleod', 'Hendrix', 'Hale', 'Foreman',
       'Barnett', 'Glass', 'Brewer', 'Lott', 'Lucas', 'Neal', 'Olsen',
       'Barrera', 'Banks', 'Carter', 'Mejia', 'Todd', 'Shelton', 'Orr',
       'Blair', 'Knight', 'Hardin', 'Colon', 'Holloway', 'Richmond',
       'Stanley', 'Foster', 'Nelson', 'Richardson', 'Nolan', 'Baird',
       'Roach', 'Wyatt', 'Garner', 'Mccarty', 'Roy', 'Carrillo',
       'Browning', 'Mcintosh', 'Macias', 'Brooks', 'Hunter', 'Johnson',
       'Hernandez', 'Cline', 'Sutton', 'Rosa', 'Fuentes', 'Fleming',
       'Beasley', 'Kramer', 'Swanson', 'Macdonald', 'Chen', 'Leonard',
       'Witt', 'Albert', 'Gross', 'Chan', 'Blackwell', 'Wilcox', 'Ewing',
       'Rutledge', 'Wynn', 'Long', 'Jensen', 'Boone', 'Huffman',
       'Richard', 'Mccullough', 'Sweet', 'Pittman', 'Whitney', 'Fischer',
       'Norman', 'Lamb', 'Jarvis', 'Matthews', 'Mann', 'Frederick',
       'Owen', 'Clemons', 'Hooper', 'Tillman', 'Wright', 'Mcneil',
       'Cochran', 'Henry', 'Duffy', 'Bright', 'Sampson', 'Hubbard',
       'Norris', 'Flowers', 'Atkinson', 'Jimenez', 'Stein', 'Shepard',
       'Dudley', 'Dean', 'Irwin', 'Kidd', 'Head', 'Travis', 'Leblanc',
       'Burks', 'Grimes', 'Chandler', 'Mayo', 'Duncan', 'Garza',
       'Whitehead', 'Meyer', 'Anderson', 'Butler', 'Lester', 'Booth',
       'Brown', 'Reid', 'Rogers', 'Riddle', 'Buckley', 'Watson',
       'Schwartz', 'Sawyer', 'Pace', 'Mason', 'Tyler', 'Glover',
       'Montgomery', 'Walls', 'Lindsay', 'Pollard', 'Shaffer', 'Mccray',
       'Dennis', 'Dalton', 'Sykes', 'Strong', 'Langley', 'Ferguson',
       'Burch', 'Cash', 'Jackson', 'Harrison', 'Conway', 'Clark', 'Allen',
       'Hill', 'Durham', 'Bernard', 'Hodges', 'Mcclure', 'Nash', 'Petty',
       'Norton', 'Rivera', 'Obrien', 'Holmes', 'Sanford', 'Monroe',
       'French', 'Savage', 'Ortiz', 'Wood', 'Hartman', 'Joseph',
       'Bridges', 'Mcdaniel', 'Mosley', 'Ayers', 'Bentley', 'Perkins',
       'Carr', 'Hutchinson', 'Terry', 'Patterson', 'Quinn', 'Byrd',
       'Bartlett', 'Montoya', 'Howe', 'Delgado', 'Lowe', 'Cook', 'Farley',
       'Harris', 'Levine', 'Price', 'Good', 'Santos', 'Valencia',
       'Richards', 'Robinson', 'Stevenson', 'Barnes', 'Roberts',
       'Holland', 'Oneil', 'Woodard', 'Randolph', 'Mccoy', 'Peterson'],
      dtype=object)

In [86]:
# how many students are in each age group
# first value is the mode
df['age'].value_counts()

17    356
18    349
19    345
16    334
14    316
15    300
Name: age, dtype: int64

### Summary statistics by group categories

While descriptive statistics can show a general overview about a dataset, calculating statistics for different categories within a feature (column) can identify patterns and trends specific to that group. The `.groupby()` and `.pivot_table()` functions both communicate statistical information within a particular demographic.

#### groupby() function 
- Is used to split the data into groups based on some criteria

In [92]:
# doesn't do anything on its own
# groupby function must be combined with a statistical calculation
df.groupby('gender')

In [93]:
# creates table of averages per gender category for all numerical-type columns 
df.groupby(df['gender']).mean()

           age  exercise   hours    grade
gender
female  16.568     3.047  10.932  82.7173
male    16.589     2.954  11.045  82.3948

In [94]:
# average hours per gender group
df.groupby(df['gender'])['hours'].mean()

gender
female    10.932
male      11.045
Name: hours, dtype: float64

In [95]:
# average hours and exercise per gender group
df.groupby(df['gender'])['hours', 'exercise'].mean()

         hours  exercise
gender
female  10.932     3.047
male    11.045     2.954

In [96]:
# first group by gender then group by age category
# average hours of study by gender and age
df.groupby(['gender', 'age'])['hours'].mean()

gender  age
female  14     10.658228
        15     11.050633
        16     11.158228
        17     10.943503
        18     10.950549
        19     10.832335
male    14     11.170886
        15     10.866197
        16     11.465909
        17     11.268156
        18     10.856287
        19     10.612360
Name: hours, dtype: float64

In [97]:
df.groupby(['age','gender'])['grade'].mean()

age  gender
14   female    82.058228
     male      82.323418
15   female    82.905696
     male      82.671831
16   female    82.582278
     male      82.752841
17   female    83.599435
     male      82.949721
18   female    82.500000
     male      82.103593
19   female    82.592216
     male      81.598315
Name: grade, dtype: float64

### Pivot table
- This tool enabled users to automatically sort, count, total, or average the data stored in one table

In [98]:
#pivot table default sta tistical function is mean
pd.pivot_table(df, index=['gender'])

           age  exercise    grade   hours
gender
female  16.568     3.047  82.7173  10.932
male    16.589     2.954  82.3948  11.045

In [99]:
# change statistical function to median
pd.pivot_table(df, index=['gender'], aggfunc='median')

        age  exercise  grade  hours
gender
female   17         3   82.6     11
male     17         3   83.0     11

In [103]:
# calculate mean for only the "age" column
pd.pivot_table(df, values=['age'], index=['gender'])

           age
gender
female  16.568
male    16.589

## Missing data

Data is messy, and one of the most common forms is missing information. In the data cleaning phase, we will learn how to handle rows and columns with missing values but first we need to identify where there is missing information. Missing values in Python are typically called ***null values*** and in a dataframe, missing cells have `NaN` (for "not a number") as a visual placeholder. To find the total number of missing values in a column, the `.isnull()` will create a column of True/False values (also called "boolean" values) depending on if the value in that cell is missing (null = True, not null = False). Then use the `.sum()` function on the resulting True/False to get a count of the number of `True` values for the missing data.

In [104]:
# load data from file and show first 5 rows of dataframe

filename = "datasets/gradedatamissing.csv"
df_missing = pd.read_csv(filename)

df_missing.head()

,fname,lname,gender,age,exercise,hours,grade,address
0,Marcia,Pugh,female,17.0,3.0,10.0,82.4,"9253 Richardson Road, Matawan, NJ 07747"
1,Kadeem,Morrison,male,18.0,4.0,4.0,78.2,"33 Spring Dr., Taunton, MA 02780"
2,Nash,Powell,male,18.0,5.0,9.0,79.3,"41 Hill Avenue, Mentor, OH 44060"
3,Noelani,Wagner,female,14.0,2.0,7.0,83.2,"8839 Marshall St., Miami, FL 33125"
4,Noelani,Cherry,female,18.0,4.0,15.0,87.4,"8304 Charles Rd., Lewis Center, OH 43035"

In [105]:
# total number of non-missing values in each column
df_missing.count()

fname       2002
lname       2002
gender      2000
age         1995
exercise    1994
hours       1994
grade       2000
address     2002
dtype: int64

In [106]:
# total missing values per column
df_missing.isnull().sum()

fname       0
lname       0
gender      2
age         7
exercise    8
hours       8
grade       2
address     0
dtype: int64

## Duplication

When looking for duplicates in `pandas`, the `.duplicated()` function by default searches for duplication across an entire row (meaning, all the values in one row are exactly the same as all the values in another row). It produces a column of boolean values (`True`/`False`) indicated if the row is a duplicate. The first time the `.duplicated()` function sees a row of information, it is not considered as duplicate (because it has not seen any other similar rows of data). However, whenever the function comes across the same information again, then that row (and any following rows that contain the same data) are then marked as duplicates. To look for duplicates only for specific columns, then use the argument `.duplicated(subset=[list of column names])`.

In [107]:
# create fake data with duplicates

names = ['Jessica','John','Bob','Jessica','Mary','John','Mel','Mel']
grades = [95,78,76,95,77,78,99,100]
dupe_data = list(zip(names,grades))

df = pd.DataFrame(data = dupe_data, columns=['Names', 'Grades'])
df

     Names  Grades
0  Jessica      95
1     John      78
2      Bob      76
3  Jessica      95
4     Mary      77
5     John      78
6      Mel      99
7      Mel     100

In [108]:
# find the duplicate rows (same information in both columns for 2+ rows)
dupe = df.duplicated()
dupe

0    False
1    False
2    False
3     True
4    False
5     True
6    False
7    False
dtype: bool

In [110]:
# choose the rows where there are True values
# duplicate of Jessica - 95; John - 78
df.loc[dupe]

     Names  Grades
3  Jessica      95
5     John      78

In [117]:
# check for duplicates only in the "Names" column (will ignore "Grades")
# Jessica, John, and Mel are name duplicates

dupe_name = df.duplicated(subset=['Names'])
df.loc[dupe_name]

     Names  Grades
3  Jessica      95
5     John      78
7      Mel     100

In [115]:
dupe_grade = df.duplicated(subset=['Grades'])
dupe_grade

0    False
1    False
2    False
3     True
4    False
5     True
6    False
7    False
dtype: bool

## Subset a dataframe

Dataframe rows and columns can be referred to in two different ways - either by their label or by their index position. Column labels are the header names and are typically purposely named in the dataset. User-defined row labels are less common; if there are not any specific labels given to the rows, then the index position also becomes the label (same goes for column labels). Because Python positions start from zero, the first column or row is always index position zero, no matter what labels are assigned to the row.

When selecting rows or column from a dataframe, it returns a smaller dataframe called a subset, which can then be assigned to its own variable name. If the original dataframe had default labels (using position) assigned to the rows (and columns, if applicable) then the subset labels will be inherited from the original dataframe, even though the index positions are different. For example, if a row had a label `4` and was also in index position `4`, then was assigned to a subset where it is now the first row, then the label would still be `4` but the position is `0`. 

There are two functions that are used to select rows or columns in a dataframe:

- `dataframe_name.loc[row label]`: select rows by label name
- `dataframe_name.iloc[row position]`: select rows by index position number

### Choosing rows

In [120]:
# create dataframe "A"
# dataframe "A" has default index positions as labels

colA = [10, 20, 40, 50]
colB = ['no', 'yes', 'yes', 'no']

A_B = list(zip(colA, colB))

df_A = pd.DataFrame(data=A_B, columns=['A', 'B'])
df_A

    A    B
0  10   no
1  20  yes
2  40  yes
3  50   no

In [121]:
# select the row from dataframe "A" with label name 0
df_A.loc[0]

A    10
B    no
Name: 0, dtype: object

In [122]:
# select the row from dataframe "A" with index position 0
df_A.iloc[0]

A    10
B    no
Name: 0, dtype: object

In [123]:
# create dataframe "B"
# dataframe "B" has user-defined labels
index = ['a', 'b', 'c', 'd']
colA = [10, 20, 40, 50]
colB = ['no', 'yes', 'yes', 'no']

df_B = pd.DataFrame(data=A_B, columns=['A', 'B'], index=index)

df_B

    A    B
a  10   no
b  20  yes
c  40  yes
d  50   no

In [124]:
# select the row in dataframe "B" with the row label name "b"
df_B.loc['b']

A     20
B    yes
Name: b, dtype: object

In [22]:
# select the row in dataframe "B" with index position 1
# same row as previous cell; different way of selecting it
df_B.iloc[1]

A     20
B    yes
Name: b, dtype: object

#### Let's see how this can get tricky

In [126]:
# dataframe "C" is a copy of dataframe "A"
df_C = df_A.copy()
df_C

    A    B
0  10   no
1  20  yes
2  40  yes
3  50   no

In [131]:
# dataframe "D" has index label names that are numbers (but not the default index positions)
index = [2,1,0,3]
colA = [10, 20, 40, 50]
colB = ['no', 'yes', 'yes', 'no']

df_D = pd.DataFrame(data=A_B, columns=['A', 'B'], index=index)
df_D

    A    B
2  10   no
1  20  yes
0  40  yes
3  50   no

Rows can also be selected as a group (not just a single row) by including the starting row and ending row with a colon between them inside the square brackets (`dataframe_name[start:end]`). When using the `.iloc` function to choose rows, it works similarly to Python list slicing - it chooses the starting index row but the ending index row position is not inclusive. However, for choosing a group of rows by the label name (`.loc`), the ending row label value is included in the subset.

In [15]:
# choose index position 0 through the index position before 3
df_D.iloc[0:3]

    A    B
2  10   no
1  20  yes
0  40  yes

In [132]:
# select label '0' and all the rows that are in between and ending with the row with label '3'
df_D.loc[2:3]

    A    B
2  10   no
1  20  yes
0  40  yes
3  50   no

In [11]:
# select rows starting from index position 0 through BUT NOT INCLUDING position 3
df_C.iloc[0:3]

    A    B
0  10   no
1  20  yes
2  40  yes

In [129]:
# select with index label '0' and everything in between and include the label '3'
df_C.loc[0:3]

    A    B
0  10   no
1  20  yes
2  40  yes
3  50   no

### Choosing columns

Just as selecting rows reduces the size of the dataframe into a subset where we can study the particular characteristics of that group, we may also want to keep certain columns from the dataset to make it easier to focus on the relevant information for analysis. To choose columns to keep for the subset dataframe, use the syntax `dataframe_name[[list of columns]]` (a list of column names inside another pair of square brackets to select that list as a dataframe).

In [ ]:
# use the gradedata.csv file

location = "datasets/gradedata.csv"
df = pd.read_csv(location)

df.head()

In [ ]:
# select the columns from the list of names "fname", "lname", "hours", and "grade"
small_df = df[['fname', 'lname', 'hours', 'grade']]

In [ ]:
# show first 5 rows of smaller dataframe with those columns only
small_df.head()

# Bonus Code!

Although not a requirement for the material that will be covered in this course, below is a code example of a task challenge you may encounter while working on a project.

### Load multiple data files

If you are faced with multiple files with information you want to aggregate into a single dataframe, instead of loading each file individually as their own separate dataframes, the `glob` library will gather a list of file names from a directory and then you can use `pandas` to create the entire dataframe automatically.

In [133]:
import glob #used to read file names in directory

# make an empty dataframe called "all_data"
# this will be used to add each file's data to previous data added
all_data = pd.DataFrame()

# iterate through each Excel file in the datasets directory with a name starting with "data"
for file in glob.glob("datasets/data*.xlsx"):
    
    #make a dataframe with that file's data
    df = pd.read_excel(file)
    
    # append (attach) the small dataframe to the overall dataframe ("all_data")
    all_data = all_data.append(df, ignore_index=True)

# view the number of rows in dataframe
# each data file had 100 rows of information (3 total files)
len(all_data)

300

In [134]:
all_data.head()

       fname  age  grade
0      Baker   14     90
1  Josephine   19    100
2     Calvin   15     66
3     Aretha   17     84
4  Britanney   19     66

In [137]:
list(all_data.columns)

['fname', 'age', 'grade']